#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Using previously-installed hashicorp/aws v4.66.1
- Using previously-installed hashicorp/kubernetes v2.20.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
data.aws_ecr_image.image: Reading...
data.aws_eks_cluster.cluster: Reading...
data.aws_ecr_repository.repo: Reading...
data.aws_ecr_authorization_token.ecr_token: Reading...
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=dev]
data.aws_ecr_authorization_token.ecr_token: Read complete after 0s [id=us-east-1]
data.aws_ecr_image.image: Read complete after 0s [id=sha256:352ee5a34d6b48904fddec6dfc5c0169ecb459245cb52c94e5cd0755e09c9612]
data.aws_eks_cluster.cluster: Read complete after 0s [id=dev]
data.aws_ecr_repository.repo: Read complete after 0s [id=simple-api-app-images]
kubernetes_namespace.ns: Refreshing state... [id=simple-app]
kubernetes_secret.secret: Refreshing state... [id=simple-app/regcred]
kubernetes_deployment.deploy: Refreshing state... [id=simple-app/simple-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_deployment.deploy is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "deploy" {
      ~ id               = "simple-app/simple-app" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
            name             = "simple-app"
          ~ resource_version = "39729" -> (known after apply)
          ~ uid              = "ab1a0862-2bf5-4187-9cf8-abe4f5869564" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                        name                       = "api"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"    = "500m" -> "0.5"
                                # (1 unchanged element hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # kubernetes_secret.secret will be updated in-place
  ~ resource "kubernetes_secret" "secret" {
      ~ data                           = (sensitive value)
        id                             = "simple-app/regcred"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jumana-s, Action: `pull_request`*